In [1]:
import pandas as pd

In [3]:
data1 = pd.read_csv("C:\\Users\\mingj\\Desktop\\woke\\interactions_test.csv")
data1.head()

   user_id  recipe_id        date  rating   u       i
0     8937      44551  2005-12-23     4.0   2  173538
1    56680     126118  2006-10-07     4.0  16  177847
2   349752     219596  2008-04-12     0.0  26   89896
3   628951      82783  2007-11-13     2.0  45  172637
4    92816     435013  2013-07-31     3.0  52  177935

In [5]:
data2 = pd.read_csv("C:\\Users\\mingj\\Desktop\\woke\\interactions_train.csv")
data2.head()

   user_id  recipe_id        date  rating      u       i
0     2046       4684  2000-02-25     5.0  22095   44367
1     2046        517  2000-02-25     5.0  22095   87844
2     1773       7435  2000-03-13     5.0  24732  138181
3     1773        278  2000-03-13     4.0  24732   93054
4     2046       3431  2000-04-07     5.0  22095  101723

In [6]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12455 entries, 0 to 12454
Data columns (total 6 columns):
user_id      12455 non-null int64
recipe_id    12455 non-null int64
date         12455 non-null object
rating       12455 non-null float64
u            12455 non-null int64
i            12455 non-null int64
dtypes: float64(1), int64(4), object(1)
memory usage: 583.9+ KB

In [7]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 698901 entries, 0 to 698900
Data columns (total 6 columns):
user_id      698901 non-null int64
recipe_id    698901 non-null int64
date         698901 non-null object
rating       698901 non-null float64
u            698901 non-null int64
i            698901 non-null int64
dtypes: float64(1), int64(4), object(1)
memory usage: 32.0+ MB

In [8]:
food=pd.concat([data1,data2],axis=0)
food.head()

   user_id  recipe_id        date  rating   u       i
0     8937      44551  2005-12-23     4.0   2  173538
1    56680     126118  2006-10-07     4.0  16  177847
2   349752     219596  2008-04-12     0.0  26   89896
3   628951      82783  2007-11-13     2.0  45  172637
4    92816     435013  2013-07-31     3.0  52  177935

In [9]:
food.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 711356 entries, 0 to 698900
Data columns (total 6 columns):
user_id      711356 non-null int64
recipe_id    711356 non-null int64
date         711356 non-null object
rating       711356 non-null float64
u            711356 non-null int64
i            711356 non-null int64
dtypes: float64(1), int64(4), object(1)
memory usage: 38.0+ MB